In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
# postgresql://host:password@username:port/database')
engine = create_engine('postgresql://postgres:post1234@127.0.0.1:5432/chinook')

# Test the connection
try:
    connection = engine.connect()
    print("Connected successfully")
except Exception as e:
    print("Connection failed:", e)

Connected successfully

In [3]:
file_path = "../Python data/raw-department-budget.txt"
sub_department = pd.read_json(file_path, lines=True)

In [4]:
sub_department

   sub_dep_id           sub_dep_name  department_id  budget
0           1               managers              1    3000
1           2              managers2              1    1500
2           1     sales support john              2    2000
3           2      sales support joe              2    1000
4           3  sales support johnson              2    2500
5           4  sales support eduards              2    2500

In [5]:
file_path2 = "../Python data/raw-department-budget2.txt"
sub_department2 = pd.read_json(file_path2)

In [6]:
sub_department2

   sub_dep_id    sub_dep_name  department_id  budget
0           1    IT purchases              3    2000
1           2  IT maintenance              3    1500
2           3        IT other              3    1000

In [7]:
file_path3 = "../Python data/raw-department.txt"
department = pd.read_csv(file_path3, 
                   sep = '-', 
                   engine = 'python')

In [8]:
department

   department_id department_name
0              1         General
1              2   Sales Support
2              3              IT

department_budget: </br>
department_id    department_name    budget

In [9]:
#merge the two datasets and remove the index
full_sub_category= pd.concat([sub_department, sub_department2]).reset_index(drop=True)

In [10]:
full_sub_category

   sub_dep_id           sub_dep_name  department_id  budget
0           1               managers              1    3000
1           2              managers2              1    1500
2           1     sales support john              2    2000
3           2      sales support joe              2    1000
4           3  sales support johnson              2    2500
5           4  sales support eduards              2    2500
6           1           IT purchases              3    2000
7           2         IT maintenance              3    1500
8           3               IT other              3    1000

In [11]:
agg = full_sub_category.groupby(['department_id']).sum()['budget']

In [12]:
department_budget = department

In [13]:
i = 0 #index
for res in agg:
    department_budget.loc[i, 'budget'] = res
    i+=1

In [17]:
department_budget

   department_id department_name  budget
0              1         General  4500.0
1              2   Sales Support  8000.0
2              3              IT  4500.0

In [15]:
table_name = 'department_budget'
schema_name = 'stg'

# Write the DataFrame to the database table
department_budget.to_sql(table_name, con=engine, schema=schema_name, if_exists='replace', index=False)

3